optional/gsPreCICE/examples/breaking-dam-2d/fluid-openfoam/constant/dynamicMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}

dynamicFvMesh dynamicMotionSolverFvMesh;

motionSolverLibs ("libfvMotionSolvers.so");

solver      displacementLaplacian;

displacementLaplacianCoeffs {
    diffusivity quadratic inverseDistance (flap);
}
